MESSAGES = {
    # Common messages

    "1000": "Неверный email или пароль.",
    "1001": "Токен недействителен или срок его действия истек.",
    "1002": "Токен был отозван.",

    "1004": "Цена должна быть больше или равна 0",

    "1005": "Должен быть список переводов.",
    "1006": "Поле 'translations' не может быть пустым.",
    "1007": "Некорректный JSON в translations",

    "1008": 'Surprisebag не найден!',

    "1009": "Количество должно быть больше 0!",

    "1010": "День недели должен быть больше 0 и меньше 7!",

    "1011": "Surprise-bag недостаточно!",


    "1100": "Вы не добавили все языки!",
    "1101": "Роль {name} уже существует на языке {lang}"
,
    "1012": "Код подтверждения получен!",
    "1013": "Позиция заказа уже подтверждена!",

    "1014": "Surprise_bag успешно создан!",

    "1015": "Surprise_bag успешно обновлён!",

    "1016": "Surprise_bag_size успешно создан!",
    "1017": "Surprise_bag_size успешно изменён!",

    "1018": "Неправильный номер заказа!",

    "400": "Неверный запрос.",
    "401": "Вы не авторизованы.",
    "403": "У вас нет прав для доступа.",
    "404": "{name} не найден.",
    "429": "Вы отправили слишком много запросов. Пожалуйста, попробуйте снова через {name} секунд.",
    "500": "Произошла непредвиденная ошибка сервера.",

    "1316": "✅ {name} успешно удалено",


    "1400": "✅ {name} создано успешно.",
    "1401": "✅ {name} успешно обновлено.",
}
